package vtb.tst;

/**
 * Какие из утверждений верны
 *      *1)  В java запрещено множественное наследование. Только один класс может быть унаследован при помощи ключевого слова extends
 *      2)  В java присутствует множественное наследование. При помощи ключевого слова extends может быть унаследовано более одного класса
 *      *3)  Класс может имплементировать несколько интерфейсов.
 *      *4)  Наследование невозможно, если калассы с модификатором класса default находятся в разных пакетах
 *      *5)  final классы невозможно наследовать
 */
public class Tst010 {
}
