package vtb.tst;

/**
 * Какие из нижеперечисленных утверждений верны для параметра classpath
 *          1)   Такого параметра в Java не сужествует
 *      *   2)   Этот параметр для JVM или компилятора, кторый предоставляет пути к зависимостям (дополнительным классам или библиотекам)
 *          3)   Это параметр для JVM или компилятора, который предоставляет пути к системных библиотекам
 *      *   4)   Это необязательный параметр, который используется при запуске или компиляции java-программ
 */
public class Tst005 {
}
