package vtb.tst;

/**
 * Для чего используется аннотация @Override
 *
 *          Как необходимый оператор при переопределении (override) любых методов интерфейса
 *          Как необходимый оператор при переопределении (override) финальных (final) любого класса
 *     *    Как вспомогательная аннотация, помогающая компилятору отследить ошибки в сигнатурах переопределенных методов
 *          Как вспомогательная аннотация, отключающая предупреждения об ошибках на этапе компиляции для переопределяемых (override) методов
 */
public class Tst019 {
}
