/**
 * Абстрактная фабрика (англ. Abstract factory) — порождающий шаблон проектирования, предоставляет интерфейс для
 * создания семейств взаимосвязанных или взаимозависимых объектов, не специфицируя их конкретных классов. Шаблон
 * реализуется созданием абстрактного класса Factory, который представляет собой интерфейс для создания компонентов
 * системы (например, для оконного интерфейса он может создавать окна и кнопки). Затем пишутся классы, реализующие этот
 * интерфейс[2].
 */
package design.patterns.creational.abstractfactory;
